pycom/pycom-micropython-sigfox/esp32/mods/modeth.c
    // re-enable int
    ksz8851_regwr(REG_INT_MASK, INT_MASK);
    portENABLE_INTERRUPTS();

}
static uint32_t process_rx(void)
{
    uint32_t len, frameCnt;
    uint32_t totalLen = 0;

    // disable int before reading buffer
    portDISABLE_INTERRUPTS();
    ksz8851_regwr(REG_INT_MASK, 0);

    frameCnt = (ksz8851_regrd(REG_RX_FRAME_CNT_THRES) & RX_FRAME_CNT_MASK) >> 8;
    uint32_t frameCntTotal = frameCnt;
    uint32_t frameCntZeroLen = 0;
    while (frameCnt > 0)
    {
        ksz8851RetrievePacketData(modeth_rxBuff, &len, frameCnt, frameCntTotal);
        if(len)
        {
            totalLen += len;
            tcpip_adapter_eth_input(modeth_rxBuff, len, NULL);
        } else {
            frameCntZeroLen++;
        }
        frameCnt--;
    }

    // re-enable int
    ksz8851_regwr(REG_INT_MASK, INT_MASK);
    portENABLE_INTERRUPTS();

    MSG("process_rx frames=%u (%u) len=%u\n", frameCntTotal, frameCntZeroLen, totalLen);
#ifdef DEBUG_MODETH
    // print last frame
    if (frameCntTotal){
        for ( uint16_t i = 0; i < len; ++i)
        {
            printf("%02x ", modeth_rxBuff[i]);
            if (i%8 == 7)
                printf("  ");
            if (i%16==15)
                printf("\n");
        }
        printf("\n");
    }
#endif

    return totalLen;
}

static void processInterrupt(void) {
    modeth_cmd_ctx_t ctx;
    ctx.buf = NULL;
    ctx.isr = 0;
    uint16_t processed = 0;

    // read interrupt status
    ctx.isr = ksz8851_regrd(REG_INT_STATUS);

    // clear interrupt status
    ksz8851_regwr(REG_INT_STATUS, 0xFFFF);

    // read rx reason
    uint16_t rxqcr = ksz8851_regrd(REG_RXQ_CMD);

    if ( ctx.isr != 0x2008 || rxqcr != 0x630 )
        MSG("processInterrupt isr=0x%x rxqcr=0x%x %s%s%s\n", ctx.isr, rxqcr,
            (rxqcr & RXQ_STAT_TIME_INT) ? "t": "",
            (rxqcr & RXQ_STAT_BYTE_CNT_INT) ? "b": "",
            (rxqcr & RXQ_STAT_FRAME_CNT_INT) ? "f": ""
        );

    // FIXME: capture errQUEUE_FULL


    if (ctx.isr & INT_RX) {
        ctx.cmd = ETH_CMD_RX;
        xQueueSendToFront(eth_cmdQueue, &ctx, portMAX_DELAY);
        processed++;
    }

    if (ctx.isr & INT_RX_OVERRUN) {
        ctx.cmd = ETH_CMD_OVERRUN;
        xQueueSendToFront(eth_cmdQueue, &ctx, portMAX_DELAY);
        processed++;
    }

    if (ctx.isr & INT_PHY) {
        ctx.cmd = ETH_CMD_CHK_LINK;
        xQueueSendToFront(eth_cmdQueue, &ctx, portMAX_DELAY);
        processed++;
    }

    if (processed != 1){
        MSG("processInterrupt 0x%x %u\n", ctx.isr, processed);
    }

    if ( ! processed ) {
        // This shouldn't happen regularly.
        // It migth be possible to happen in this case:
        // - interupt fires
        // - cmd is put is received via the queue
        // - another interupt fires and puts a new cmd into the queue
        // - processInterrupt for the first one is exectued, but handles both (all) events
        // - later the second cmd is handled but processInterrupt doesn't find anything to do
        // - this case shouldn't be a real problem though
        ctx.cmd = ETH_CMD_OTHER;
        xQueueSend(eth_cmdQueue, &ctx, portMAX_DELAY);
        processed++;
    }

}


/* callback runs from interrupt context */
static IRAM_ATTR void ksz8851_evt_callback(uint32_t ksz8851_evt)
{
    modeth_cmd_ctx_t ctx;
    ctx.cmd = ETH_CMD_HW_INT;
    ctx.buf = NULL;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xQueueSendToFrontFromISR(eth_cmdQueue, &ctx, &xHigherPriorityTaskWoken);
    // seems is needed for link up at the start ... TODO is it actually the best solution to ulTaskNotifyTake() from Task_ETHERNET to wait for link up?
    // xTaskNotifyFromISR(ethernetTaskHandle, 0, eIncrement, NULL);
}

// void printTaskStatus(){
//     UBaseType_t numTasks = uxTaskGetNumberOfTasks();
//     char* taskStatusWriteBuffer = (char*) heap_caps_malloc(sizeof(char) * 40 * numTasks, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
//     vTaskGetRunTimeStats(taskStatusWriteBuffer);
//     MSG("TE vTaskGetRunTimeStats:\n%s\n", taskStatusWriteBuffer);
//     heap_caps_free(taskStatusWriteBuffer);
// }

static void TASK_ETHERNET (void *pvParameters) {
    MSG("TE\n");

    static uint32_t thread_notification;
    system_event_t evt;
    modeth_cmd_ctx_t queue_entry;
    uint16_t timeout = 0;
    uint16_t max_timeout = 50u; // 5

    // Block task till notification is recieved
    thread_notification = ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    MSG("TE tn=%u\n", thread_notification);

    if (thread_notification)
    {
        if(ESP_OK != esp_read_mac(ethernet_mac, ESP_MAC_ETH))
        {
            // Set mac to default
            ethernet_mac[0] = KSZ8851_MAC0;
            ethernet_mac[1] = KSZ8851_MAC1;
            ethernet_mac[2] = KSZ8851_MAC2;
            ethernet_mac[3] = KSZ8851_MAC3;
            ethernet_mac[4] = KSZ8851_MAC4;
            ethernet_mac[5] = KSZ8851_MAC5;
        }
        else
        {
            // check for MAC address limitation of KSZ8851 (5th Byte should not be 0x06)
            if(ethernet_mac[4] == 0x06)
            {
                // OR this byte with last byte
                ethernet_mac[4] |= (ethernet_mac[5] | 0x01 /*Just in case if last byte = 0*/ );
            }
        }
        //save mac
        memcpy(eth_obj.mac, ethernet_mac, ETH_MAC_SIZE);

        //Init spi
        ksz8851SpiInit();
        /* link status  */
        ksz8851RegisterEvtCb(ksz8851_evt_callback);
eth_start:
        MSG("TE eth_start\n");
        xQueueReset(eth_cmdQueue);
        xEventGroupWaitBits(eth_event_group, ETHERNET_EVT_STARTED, false, true, portMAX_DELAY);
        MSG("TE init driver\n");
        // Init Driver
        ksz8851Init();

        evt.event_id = SYSTEM_EVENT_ETH_START;
        esp_event_send(&evt);

        MSG("TE ls=%u 10M=%u 100M=%u\n", get_eth_link_speed(), ETH_SPEED_MODE_10M, ETH_SPEED_MODE_100M);
        UBaseType_t stack_high = uxTaskGetStackHighWaterMark(NULL);
        // MSG("TE stack_high=%u\n", stack_high);

        uint32_t ct = 0;
        uint32_t ctTX = 0;
        uint32_t ctRX = 0;
        uint32_t totalTX = 0;
        uint32_t totalRX = 0;
        bool printStat = false;
        uint16_t interrupt_pin_value = pin_get_value(KSZ8851_INT_PIN);
        uint16_t interrupt_stati = 0;
        for(;;)
        {
            UBaseType_t stack_high_new = uxTaskGetStackHighWaterMark(NULL);
            uint16_t interrupt_pin_value_new = pin_get_value(KSZ8851_INT_PIN);
            //uint16_t interrupt_value_new = ksz8851_regrd(REG_INT_STATUS);
            uint16_t interrupt_stati_new = 0;
            interrupt_stati_new = ksz8851_regrd(REG_INT_STATUS);
            if ( interrupt_stati_new != interrupt_stati ) {
                if (interrupt_stati_new)
                    printStat = true;
                interrupt_stati = interrupt_stati_new;
            }
            if (stack_high_new > stack_high) {
                stack_high = stack_high_new;
                printStat = true;
            }
            if (interrupt_pin_value_new != interrupt_pin_value ) {
                interrupt_pin_value = interrupt_pin_value_new;
                printStat = true;
            }


            ct++;

            // if(!eth_obj.link_status && (xEventGroupGetBits(eth_event_group) & ETHERNET_EVT_STARTED))
            // {
            //     // block till link is up again
            //     MSG("TE link not up\n");
            //     ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
            // }

            // MSG("TE x\n");
            if(!(xEventGroupGetBits(eth_event_group) & ETHERNET_EVT_STARTED))
            {
                MSG("TE not started\n");
                // deinit called, free memory and block till re-init
                xQueueReset(eth_cmdQueue);
                heap_caps_free(modeth_rxBuff);
                eth_obj.link_status = false;
                evt.event_id = SYSTEM_EVENT_ETH_DISCONNECTED;
                esp_event_send(&evt);
                //Disable  interrupts
                ksz8851_regwr(REG_INT_MASK, 0x0000);
                MSG("TE goto eth_start\n");
                goto eth_start;
            }

            if (xQueueReceive(eth_cmdQueue, &queue_entry, 200 / portTICK_PERIOD_MS) == pdTRUE)
            {


